

# <font color="#ff4500" style="font-size: 30px;">Código Python Todo Dia</font>

<hr style="border: 2px solid #4500ff;">

# <font color="#4500ff" style="font-size: 25px;">Exercício 159</font>
<hr style="border: 2px solid #4500ff;">

 <p style='font-size: 23px; line-height: 2; margin: 0px 0px; text-align: justify; text-indent: 0px;'>    
<i><b> Elabore um script que crie um banco de dados denominado estoque.db, usando SQLite3. A tabela ESTOQUE criada deve armazenar as seguintes informações: nome, preço e quantidade.

## obs: Lembrete, para criar uma tabela usando SQL:
    
```python
    CREATE TABLE NOME (
    COLUNA1 datatype,
    COLUNA2 datatype,
    COLUNA3 datatype,
    COLUNA4 datatype,
    ...
    COLUNAn datatype
 
)
```
</b></i>     
</p>

---

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine, inspect, text

# sqlalchemy : SQLAlchemy é uma biblioteca Python para interagir com bancos de dados relacionais. 

# create_engine: cria uma conexão com o banco.

# inspect: inspeciona a estrutura do banco.

# text: permite escrever consultas SQL de forma mais flexível.

In [2]:
# Caminho para o arquivo .db
caminho_banco = "banco_de_dados_SQLite/estoque.db"

# Criação da engine
engine = create_engine(f'sqlite:///{caminho_banco}')

# Instância do objeto inspector
inspector = inspect(engine)

# Lista os nomes das tabelas no banco de dados
print(inspector.get_table_names())

['ESTOQUE']

In [3]:
def sql_df(query):
    "função que recebe e executa as querys"
    with engine.connect() as conexao:  # Cria uma conexão com o banco de dados
        consulta = conexao.execute(text(query))  # Executa a consulta SQL
        dados = consulta.fetchall()  # Busca todos os resultados da consulta
    return pd.DataFrame(dados, columns=consulta.keys())  # Retorna os resultados como DataFrame

In [4]:
query= 'SELECT * FROM estoque'

df_estoque = sql_df(query)
df_estoque

Empty DataFrame
Columns: [NOME, PRECO, QUANTIDADE]
Index: []

In [5]:
# eu ja tinha a tabela, mas o outro jeito é: 

import sqlite3  # Importa a biblioteca SQLite3

# Define a conexão com o banco de dados
conn = sqlite3.connect('estoque.db')

# Cria um cursor para executar comandos SQL
cur = conn.cursor()

#deleta a tabela CLIENTE caso já exista
cur.execute('DROP TABLE IF EXISTS ESTOQUES')

# Cria a tabela ESTOQUE
consulta_ = cur.execute('''CREATE TABLE ESTOQUES (
                nome TEXT,
                preco REAL,
                quantidade INTEGER
            )''')

# Salva as alterações
conn.commit()

# Fecha a conexão
conn.close()

<hr style="border: 2px solid #4500ff;">

# <font color="#4500ff" style="font-size: 25px;">Exercício 160</font>
<hr style="border: 2px solid #4500ff;">

 <p style='font-size: 23px; line-height: 2; margin: 0px 0px; text-align: justify; text-indent: 0px;'>    
<i><b> Elabore um script que crie um banco de dados denominado cliente.db, usando SQLite3. A tabela CLIENTE criada deve armazenar as seguintes informações: id, nome, sobrenome, idade, peso, sexo e renda.



## obs: Lembrete, para criar uma tabela usando SQL:
    
```python
    CREATE TABLE NOME (
    COLUNA1 datatype,
    COLUNA2 datatype,
    COLUNA3 datatype,
    COLUNA4 datatype,
    ...
    COLUNAn datatype
 
)
```
</b></i>     
</p>

---

In [6]:
# JEITO 1

cliente_df = pd.DataFrame(columns= ['id', 'nome', 'sobrenome', 'idade', 'peso', 'sexo', 'renda'])

cliente_df.to_sql('cliente_df',engine,index=False)

inspector = inspect(engine)
print(inspector.get_table_names())

['ESTOQUE', 'cliente_df']

In [7]:
query= 'SELECT * FROM cliente_df'

df_cliente = sql_df(query)
df_cliente

Empty DataFrame
Columns: [id, nome, sobrenome, idade, peso, sexo, renda]
Index: []

In [8]:
# JEITO 2

# Define a conexão com o banco de dados
conexao = sqlite3.connect('cliente.db')

# Cria um cursor para executar comandos SQL
cursor = conexao.cursor()

# deleta a tabela CLIENTE caso já exista
cursor.execute('DROP TABLE IF EXISTS df_cliente')

# Cria a tabela CLIENTE
consulta_ = cursor.execute("""CREATE TABLE df_cliente(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    NOME CHAR(30) NOT NULL,
    SOBRENOME CHAR(20),
    IDADE INT,
    PESO FLOAT,
    SEXO CHAR(1),
    RENDA FLOAT
    )""")

# Salva as alterações
conexao.commit()

# Fecha a conexão
conexao.close()

<hr style="border: 2px solid #4500ff;">

# <font color="#4500ff" style="font-size: 25px;">Exercício 161</font>
<hr style="border: 2px solid #4500ff;">

 <p style='font-size: 23px; line-height: 2; margin: 0px 0px; text-align: justify; text-indent: 0px;'>    
<i><b> Adicione dois produtos na tabela ESTOQUE criada no exercício 1.



## Lembrete:
    
```python
INSERT INTO NOME_TABELA (coluna1, coluna2, coluna3,..., colunaN)
    VALUES (valor1, valor2, valor3,..., valorN);
 
```
</b></i>     
</p>

---

In [9]:
# JEITO 1

QUERY = '''INSERT INTO ESTOQUE (nome, preco, quantidade)
           VALUES ('PS5', 5000, 2),
                  ('XBOX', 3000, 5)'''


with engine.connect() as conexao:  # Cria uma conexão com o banco de dados
    consulta = conexao.execute(text(QUERY))  # Executa a consulta SQL

In [10]:
query= 'SELECT * FROM estoque'

df_estoque = sql_df(query)
df_estoque

   NOME   PRECO  QUANTIDADE
0   PS5  5000.0           2
1  XBOX  3000.0           5

In [11]:
import sqlite3  # Importa a biblioteca SQLite3

# Define a conexão com o banco de dados
conn = sqlite3.connect('estoque.db')

# Cria um cursor para executar comandos SQL
cur = conn.cursor()

# Cria a tabela ESTOQUE
consulta_ = cur.execute('''INSERT INTO ESTOQUES (nome, preco, quantidade)
           VALUES ('PS5', 5000, 2),
                  ('XBOX', 3000, 5)''')

# Salva as alterações
conn.commit()

# Fecha a conexão
conn.close()

In [12]:
# Define a conexão com o banco de dados
conn = sqlite3.connect('estoque.db')

# Cria um cursor para executar comandos SQL
cur = conn.cursor()

# Executa uma consulta SQL para selecionar todos os dados da tabela ESTOQUE
cur.execute('SELECT * FROM ESTOQUES')

# Obtém todos os dados retornados pela consulta
dados = cur.fetchall()

# Cria um DataFrame do Pandas com os dados obtidos
estoques = pd.DataFrame(dados, columns=['Nome', 'Preço', 'Quantidade'])

# Exibe o DataFrame
print(estoques)

# Fecha a conexão
conn.close()

   Nome   Preço  Quantidade
0   PS5  5000.0           2
1  XBOX  3000.0           5

<hr style="border: 2px solid #4500ff;">

# <font color="#4500ff" style="font-size: 25px;">Exercício 162</font>
<hr style="border: 2px solid #4500ff;">

 <p style='font-size: 23px; line-height: 2; margin: 0px 0px; text-align: justify; text-indent: 0px;'>    
<i><b> Adicione 3 registros na tabela CLIENTE criada no exercício 2.



## Lembrete:
    
```python
INSERT INTO NOME_TABELA (coluna1, coluna2, coluna3,..., colunaN)
    VALUES (valor1, valor2, valor3,..., valorN);
 
```
</b></i>     
</p>

---

In [13]:
# JEITO 1

QUERY = '''INSERT INTO cliente_df (id, nome, sobrenome, idade, peso, sexo, renda)
           VALUES (0, 'MIGUEL', 'FREIRE', 24, 67, 'M', 'XXXXXX'),
                  (1, 'ANGEL', 'BITONI', 26, 75, 'M', 'XXXXXX')'''


with engine.connect() as conexao:  # Cria uma conexão com o banco de dados
    consulta = conexao.execute(text(QUERY))  # Executa a consulta SQL

In [14]:
query= 'SELECT * FROM cliente_df'

df_estoque = sql_df(query)
df_estoque

  id    nome sobrenome idade peso sexo   renda
0  0  MIGUEL    FREIRE    24   67    M  XXXXXX
1  1   ANGEL    BITONI    26   75    M  XXXXXX

In [15]:
import sqlite3  # Importa a biblioteca SQLite3

# Define a conexão com o banco de dados
conn = sqlite3.connect('cliente.db')

# Cria um cursor para executar comandos SQL
cur = conn.cursor()

# Cria a tabela ESTOQUE
consulta_ = cur.execute('''INSERT INTO df_cliente (id, nome, sobrenome, idade, peso, sexo, renda)
           VALUES (2, 'MIGUEL', 'FREIRE', 24, 67, 'M', 'XXXXXX'),
                  (1, 'ANGEL', 'BITONI', 26, 75, 'M', 'XXXXXX')''')

# Salva as alterações
conn.commit()

# Cria um cursor para executar comandos SQL
cur = conn.cursor()

# Executa uma consulta SQL para selecionar todos os dados da tabela ESTOQUE
cur.execute('SELECT * FROM df_cliente')

# Obtém todos os dados retornados pela consulta
dados = cur.fetchall()

# Cria um DataFrame do Pandas com os dados obtidos
clientes = pd.DataFrame(dados, columns=['id', 'nome', 'sobrenome', 'idade', 'peso', 'sexo', 'renda'])

# Exibe o DataFrame
print(clientes)

# Fecha a conexão
conn.close()

   id    nome sobrenome  idade  peso sexo   renda
0   1   ANGEL    BITONI     26  75.0    M  XXXXXX
1   2  MIGUEL    FREIRE     24  67.0    M  XXXXXX

<hr style="border: 2px solid #4500ff;">

# <font color="#4500ff" style="font-size: 25px;">Exercício 163</font>
<hr style="border: 2px solid #4500ff;">

 <p style='font-size: 23px; line-height: 2; margin: 0px 0px; text-align: justify; text-indent: 0px;'>    
<i><b> Elabore um script que crie um banco de dados denominado dados_alunos.db, usando SQLite3. A tabela alunos criada deve armazenar as seguintes informações: id, nome, idade, telefone, profissão.



## Em seguida:
    
## 1. adicione os registros da lista abaixo no banco de dados (use executemany());    
    
```python
dados = [('Yun', 29, '+00000000','Músico'),
         ('Chan', 37, '+00000000', 'Engenheiro Elétrico'),
         ('Ayumi', 41, '+00000000', 'Programador'),
         ('Hinata', 25, '+00000000', 'Professor')
        ]
 
```
    
## 2. mostre todos os registros na tela.    
</b></i>     
</p>

---

In [16]:
from sqlalchemy import create_engine, Table, Column, Integer, String, MetaData

# Define o caminho do banco de dados
caminho_desejado = "banco_de_dados_SQLite/alunos.db"

# Cria um engine para a conexão com o banco de dados
engine = create_engine(f"sqlite:///{caminho_desejado}")

# Define um objeto Metadata
metadata = MetaData()

# Define a tabela 'alunos' com as colunas especificadas
alunos = Table('alunos', metadata,
               Column('id', Integer, primary_key=True),
               Column('nome', String),
               Column('idade', Integer),
               Column('telefone', String),
               Column('profissão', String)
              )

# Cria o banco de dados e a tabela 'alunos' se não existirem
metadata.create_all(engine)

In [17]:
query= 'SELECT * FROM alunos'

df_alunos = sql_df(query)
df_alunos

Empty DataFrame
Columns: [id, nome, idade, telefone, profissão]
Index: []

In [18]:
QUERY = '''INSERT INTO alunos (id, nome, idade, telefone, profissão)
           VALUES (0,'Yun', 29, '+00000000','Músico'),
                  (1, 'Chan', 37, '+00000000', 'Engenheiro Elétrico'),
                  (2, 'Ayumi', 41, '+00000000', 'Programador'),
                  (3, 'Hinata', 25, '+00000000', 'Professor')'''


with engine.connect() as conexao:  # Cria uma conexão com o banco de dados
    consulta = conexao.execute(text(QUERY))  # Executa a consulta SQL

In [19]:
query= 'SELECT * FROM alunos'

df_alunos = sql_df(query)
df_alunos

   id    nome  idade   telefone            profissão
0   0     Yun     29  +00000000               Músico
1   1    Chan     37  +00000000  Engenheiro Elétrico
2   2   Ayumi     41  +00000000          Programador
3   3  Hinata     25  +00000000            Professor

In [21]:
import sqlite3
import pandas as pd

# Define o caminho do banco de dados
caminho_desejado = "banco_de_dados_SQLite/alunos_.db"

# Conecta-se ao banco de dados
conn = sqlite3.connect(caminho_desejado)

# Cria um cursor para executar comandos SQL
cur = conn.cursor()

# Cria a tabela 'alunos' se não existir
cur.execute('''CREATE TABLE IF NOT EXISTS alunos (
                id INTEGER PRIMARY KEY,
                nome TEXT,
                idade INTEGER,
                telefone TEXT,
                profissao TEXT
            )''')

# Insere os dados na tabela 'alunos'
dados_alunos = [
    (0, 'Yun', 29, '+00000000', 'Músico'),
    (1, 'Chan', 37, '+00000000', 'Engenheiro Elétrico'),
    (2, 'Ayumi', 41, '+00000000', 'Programador'),
    (3, 'Hinata', 25, '+00000000', 'Professor')
]
cur.executemany('INSERT INTO alunos VALUES (?, ?, ?, ?, ?)', dados_alunos)

# Salva as alterações
conn.commit()

# Executa uma consulta SQL para selecionar todos os dados da tabela 'alunos'
cur.execute('SELECT * FROM alunos')

# Obtém todos os dados retornados pela consulta
dados = cur.fetchall()

# Cria um DataFrame do Pandas com os dados obtidos
alunos = pd.DataFrame(dados, columns=['id', 'nome', 'idade', 'telefone', 'profissao'])

# Exibe o DataFrame
print(alunos)

# Fecha a conexão
conn.close()

   id    nome  idade   telefone            profissao
0   0     Yun     29  +00000000               Músico
1   1    Chan     37  +00000000  Engenheiro Elétrico
2   2   Ayumi     41  +00000000          Programador
3   3  Hinata     25  +00000000            Professor

In [22]:
# JEITO 3

import sqlite3
from contextlib import closing
 
with sqlite3.connect('dados_alunos.db') as conn:
    with closing(conn.cursor()) as cursor:
        
        #cria a tabela alunos
        sql = """CREATE TABLE IF NOT EXISTS alunos (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        nome VARCHAR(55) NOT NULL,
        idade INTEGER NOT NULL,
        telefone VARCHAR(15) NOT NULL,
        profissao VARCHAR(30) NOT NULL
        )
        """
        cursor.execute(sql)
        
        #inserindo registros
        dados = [('Yun', 29, '+00000000','Músico'),
                 ('Chan', 37, '+00000000', 'Engenheiro Elétrico'),
                 ('Ayumi', 41, '+00000000', 'Programador'),
                 ('Hinata', 25, '+00000000', 'Professor')
                ]
        
        sql = """INSERT INTO alunos(nome,idade,telefone,profissao) VALUES(?,?,?,?)"""
        cursor.executemany(sql, dados)
        
        #Mostra os dados
        resultados = cursor.execute("SELECT * FROM alunos")
        for registro in resultados:
            print(f'id: {registro[0]}')
            print(f'Nome: {registro[1]}')
            print(f'Idade: {registro[2]}')
            print(f'Telefone: {registro[3]}')
            print(f'Profissão: {registro[4]}')
            print()

id: 1
Nome: Yun
Idade: 29
Telefone: +00000000
Profissão: Músico

id: 2
Nome: Chan
Idade: 37
Telefone: +00000000
Profissão: Engenheiro Elétrico

id: 3
Nome: Ayumi
Idade: 41
Telefone: +00000000
Profissão: Programador

id: 4
Nome: Hinata
Idade: 25
Telefone: +00000000
Profissão: Professor